---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.UserModifiable
source: html/a4063402-872a-294c-184c-f445c195b91d.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.UserModifiable Property

This property indicates whether this parameter can be modified by UI user or not.

## Syntax (C#)
```csharp
public bool UserModifiable { get; set; }
```